programming/2022-08-26-155254-metaprogramming.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-14 Fri 07:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Metaprogramming</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/org.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
  <div class="navbar-mode-line">
    <a href="/" class="navbar-circle">◉</a>
    <a href="/programming" class="navbar-filename">Programming</a>
    <a href="/hacking" class="navbar-filename">Hacking</a>
    <a href="/Tutorial" class="navbar-filename">Tutorials</a>
    <a href="/posts.html" class="navbar-filename">All Posts</a>
    <a href="/rss.xml" class="navbar-filename">Rss Feed</a>
  </div>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Metaprogramming</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2a496c8">Metaprogramming in nim</a>
<ul>
<li><a href="#org7369f01">Generics</a>
<ul>
<li><a href="#orgee7666d">Generic Procedures</a></li>
<li><a href="#orgd16efb1">Constraining Generics</a></li>
<li><a href="#orgdab01f9">Templates</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<ul class="org-ul">
<li><a href="20220606215451-nim.html#ID-af6fae74-d03b-4930-8f39-63becb43efd9">Nim</a></li>
</ul>


<div id="outline-container-org2a496c8" class="outline-2">
<h2 id="org2a496c8">Metaprogramming in nim</h2>
<div class="outline-text-2" id="text-org2a496c8">
<p>
Some notes From Nim in Action
</p>
</div>
<div id="outline-container-org7369f01" class="outline-3">
<h3 id="org7369f01">Generics</h3>
<div class="outline-text-3" id="text-org7369f01">
<p>
Generics allow you to write programs in a style which you do not know the types until the algorithm is called.
It helps you with code duplication.
You can define as many generic types as you want!
</p>

<p>
Some languages may refer to them as <code>parametric polymorphism</code> also known as <code>templates</code>
</p>
</div>


<div id="outline-container-orgee7666d" class="outline-4">
<h4 id="orgee7666d">Generic Procedures</h4>
<div class="outline-text-4" id="text-orgee7666d">
<p>
An example generic procedure from the book
</p>

<div class="org-src-container">
<pre class="src src-nim"><span style="color: #ff2afc; font-weight: bold;">proc</span> <span style="color: #42c6ff;">myMax</span>[<span style="color: #ffd400;">T</span>](a, b: <span style="color: #ffd400;">T</span>): <span style="color: #ffd400;">T</span> =
  <span style="color: #ff2afc; font-weight: bold;">if</span> a &lt; b:
    <span style="color: #ff2afc; font-weight: bold;">return</span> b
  <span style="color: #ff2afc; font-weight: bold;">else</span>:
    <span style="color: #ff2afc; font-weight: bold;">return</span> a
<span style="color: #1ea8fc;">doAssert</span> myMax(<span style="color: #ffd400; font-weight: bold;">5</span>, <span style="color: #ffd400; font-weight: bold;">10</span>) == <span style="color: #ffd400; font-weight: bold;">10</span>
<span style="color: #1ea8fc;">doAssert</span> myMax(<span style="color: #ffd400; font-weight: bold;">31.3</span>, <span style="color: #ffd400; font-weight: bold;">1.23124</span>) == <span style="color: #ffd400; font-weight: bold;">31.3</span>
</pre>
</div>

<p>
The compiler may not be able to infer generic types. You can explicitly set them with square brackets
</p>

<div class="org-src-container">
<pre class="src src-nim"><span style="color: #1ea8fc;">doAssert</span> myMax[<span style="color: #ffd400;">float</span>](<span style="color: #ffd400; font-weight: bold;">5</span>, <span style="color: #ffd400; font-weight: bold;">10.5</span>) == <span style="color: #ffd400; font-weight: bold;">10.5</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgd16efb1" class="outline-4">
<h4 id="orgd16efb1">Constraining Generics</h4>
<div class="outline-text-4" id="text-orgd16efb1">
<p>
Constraining generics makes it easier to convey to you and others the meaning of the generic.
</p>

<p>
An example would be to call myMax with two strings
</p>

<div class="org-src-container">
<pre class="src src-nim"><span style="color: #1ea8fc;">echo</span> myMax(<span style="color: #7984D1;">"Hello"</span>, <span style="color: #7984D1;">"World!"</span>)
</pre>
</div>

<p>
This will result in an error
</p>
</div>

<ul class="org-ul">
<li><a id="org7935b52"></a>type classes/concepts<br />
<div class="outline-text-5" id="text-org7935b52">
<p>
Concepts is also known as a user defined type classs in other languages, are a construct to create requirements that a matched type must satisfy.
</p>

<p>
Example
</p>
<div class="org-src-container">
<pre class="src src-nim"><span style="color: #ff2afc; font-weight: bold;">type</span>
  <span style="color: #ffd400;">Comparable</span> = <span style="color: #ff2afc; font-weight: bold;">concept</span> a
    (a &lt; a) <span style="color: #1ea8fc; font-style: italic;">is</span> <span style="color: #ffd400;">bool</span>
</pre>
</div>
<p>
Concepts are created with the <code>concept</code> keyword, after that is the type identifiers.
In the example the type is matched when a &lt; returns a bool.
</p>
</div>
</li>
</ul>
</div>


<div id="outline-container-orgdab01f9" class="outline-4">
<h4 id="orgdab01f9">Templates</h4>
<div class="outline-text-4" id="text-orgdab01f9">
<p>
Nim&rsquo;s <code>templates</code> are procedures that produce code. The easily allows you to deal with boilerplate code.
They allow you to inject varibles into the calling scope.
To call a template you just call it like a procedure.
</p>

<p>
Example from the book
</p>

<div class="org-src-container">
<pre class="src src-nim"><span style="color: #ff2afc; font-weight: bold;">template</span> <span style="color: #42c6ff;">`!=` </span>(a, b: <span style="color: #ffd400;">untyped</span>) =
  <span style="color: #1ea8fc;">not</span> (a == b)
</pre>
</div>

<p>
you can define <code>!=</code> but you would need to define one fo each type or use generarics
An example would be to look at <a href="../2022-05-28-030619-star_intel.html#ID-78157cd5-9681-4a64-b5c7-0f2b415cd446">star intel</a> how i used to use function overloading and now i use templates.
</p>
</div>

<ul class="org-ul">
<li><a id="orgd9a54e2"></a>Code blocks<br />
<div class="outline-text-5" id="text-orgd9a54e2">
<p>
A code block is a set of statments. passing multiple statements into a procedure into a procecure needs anonmouse functions.
Templates have a sepcial syntax to support more than one statement.
</p>

<p>
Example from book
</p>

<div class="org-src-container">
<pre class="src src-nim"><span style="color: #ff2afc; font-weight: bold;">import</span> os
<span style="color: #ff2afc; font-weight: bold;">template</span> <span style="color: #42c6ff;">repeat</span>(statements: <span style="color: #ffd400;">untyped</span>) =
  <span style="color: #ff2afc; font-weight: bold;">while</span> <span style="color: #df85ff; font-weight: bold;">true</span>:
    statements

repeat:
  <span style="color: #1ea8fc;">echo</span>(<span style="color: #7984D1;">"Hello Templates!"</span>)
  sleep(<span style="color: #ffd400; font-weight: bold;">1000</span>)
</pre>
</div>

<p>
the statments is replaces with whatever code block is passed. when passed it looks like this
</p>

<div class="org-src-container">
<pre class="src src-nim"><span style="color: #ff2afc; font-weight: bold;">import</span> os
<span style="color: #ff2afc; font-weight: bold;">while</span> <span style="color: #df85ff; font-weight: bold;">true</span>:
  <span style="color: #1ea8fc;">echo</span>(<span style="color: #7984D1;">"Hello Templates!"</span>)
  sleep(<span style="color: #ffd400; font-weight: bold;">1000</span>)
</pre>
</div>

<p>
NOTE: when a code block is passed, the last parameter always contains it
</p>
</div>
<ul class="org-ul">
<li><a id="org9cd6cb6"></a><span class="todo IDEA">IDEA</span> read on nim&rsquo;s do syntax<br /></li>
</ul>
</li>

<li><a id="org5b56530"></a>Untype Versus Typed<br />
<div class="outline-text-5" id="text-org5b56530">
<ul class="org-ul">
<li>Untyped: Allows Indentifers that has yet to be delclared.</li>
<li>Typed: allows a indentifier that has a type and by concrete type like <code>float, int and string</code></li>
</ul>
</div>
</li>

<li><a id="org0e6dca1"></a>Template hygiene<br />
<div class="outline-text-5" id="text-org0e6dca1">
<p>
Templates can define vairbles that can be accessible after the template.
you might not want that and this is called <code>template hygiene</code>.
</p>

<p>
Example from book
</p>

<div class="org-src-container">
<pre class="src src-nim"><span style="color: #ff2afc; font-weight: bold;">template</span> <span style="color: #42c6ff;">declareVar</span>(varName: <span style="color: #ffd400;">untyped</span>, value: <span style="color: #ffd400;">typed</span>) =
  <span style="color: #ff2afc; font-weight: bold;">var</span> <span style="color: #df85ff;">varName </span>= value
declareVar(foo, <span style="color: #ffd400; font-weight: bold;">42</span>)
<span style="color: #1ea8fc;">echo</span>(foo)
</pre>
</div>

<p>
Calling the template declares a new var becuase the the var is <code>injected</code> into the calling scope.
Normaly vars are not injected into the scope, unless marked with the <code>{.inject.}</code> pragma.
Trying to acess a var without that results in error.
</p>
</div>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:unseen@flake">unseen@flake</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.6.1)</p>
<p class="validation"></p>
</div>
</body>
</html>